Revit 2026 API

# ExportLinetypeTableIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo> Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportLinetypeKey, ExportLinetypeInfo)
	Get
```
```cpp
public:
virtual property KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^> Current {
	KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^> get ();
}
```
```fsharp
abstract Current : KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo> with get
override Current : KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo> with get
```

#### Property Value

KeyValuePairExportLinetypeKey, ExportLinetypeInfo

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ExportLinetypeTableIterator Class

Autodesk.Revit.DB Namespace